
{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "Input1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "name": "Input1"}, "inbound_nodes": []}, {"name": "C1_1", "class_name": "Conv2D", "config": {"name": "C1_1", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Input1", 0, 0, {}]]]}, {"name": "Relu1_1", "class_name": "Activation", "config": {"name": "Relu1_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["C1_1", 0, 0, {}]]]}, {"name": "BN1_1", "class_name": "BatchNormalization", "config": {"name": "BN1_1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Relu1_1", 0, 0, {}]]]}, {"name": "C1_2", "class_name": "Conv2D", "config": {"name": "C1_2", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BN1_1", 0, 0, {}]]]}, {"name": "Relu1_2", "class_name": "Activation", "config": {"name": "Relu1_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["C1_2", 0, 0, {}]]]}, {"name": "BN1_2", "class_name": "BatchNormalization", "config": {"name": "BN1_2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Relu1_2", 0, 0, {}]]]}, {"name": "C1_3", "class_name": "Conv2D", "config": {"name": "C1_3", "trainable": true, "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BN1_2", 0, 0, {}]]]}, {"name": "Relu1_3", "class_name": "Activation", "config": {"name": "Relu1_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["C1_3", 0, 0, {}]]]}, {"name": "BN1_3", "class_name": "BatchNormalization", "config": {"name": "BN1_3", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Relu1_3", 0, 0, {}]]]}, {"name": "MP1", "class_name": "MaxPooling2D", "config": {"name": "MP1", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["BN1_3", 0, 0, {}]]]}, {"name": "Drop1", "class_name": "Dropout", "config": {"name": "Drop1", "trainable": true, "rate": 0.4, "noise_shape": null, "seed": null}, "inbound_nodes": [[["MP1", 0, 0, {}]]]}, {"name": "C2_1", "class_name": "Conv2D", "config": {"name": "C2_1", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Drop1", 0, 0, {}]]]}, {"name": "Relu2_1", "class_name": "Activation", "config": {"name": "Relu2_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["C2_1", 0, 0, {}]]]}, {"name": "BN2_1", "class_name": "BatchNormalization", "config": {"name": "BN2_1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Relu2_1", 0, 0, {}]]]}, {"name": "C2_2", "class_name": "Conv2D", "config": {"name": "C2_2", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BN2_1", 0, 0, {}]]]}, {"name": "Relu2_2", "class_name": "Activation", "config": {"name": "Relu2_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["C2_2", 0, 0, {}]]]}, {"name": "BN2_2", "class_name": "BatchNormalization", "config": {"name": "BN2_2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Relu2_2", 0, 0, {}]]]}, {"name": "C2_3", "class_name": "Conv2D", "config": {"name": "C2_3", "trainable": true, "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BN2_2", 0, 0, {}]]]}, {"name": "Relu2_3", "class_name": "Activation", "config": {"name": "Relu2_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["C2_3", 0, 0, {}]]]}, {"name": "BN2_3", "class_name": "BatchNormalization", "config": {"name": "BN2_3", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Relu2_3", 0, 0, {}]]]}, {"name": "MP2", "class_name": "MaxPooling2D", "config": {"name": "MP2", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["BN2_3", 0, 0, {}]]]}, {"name": "Drop2", "class_name": "Dropout", "config": {"name": "Drop2", "trainable": true, "rate": 0.4, "noise_shape": null, "seed": null}, "inbound_nodes": [[["MP2", 0, 0, {}]]]}, {"name": "C3", "class_name": "Conv2D", "config": {"name": "C3", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Drop2", 0, 0, {}]]]}, {"name": "Relu3", "class_name": "Activation", "config": {"name": "Relu3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["C3", 0, 0, {}]]]}, {"name": "BN3", "class_name": "BatchNormalization", "config": {"name": "BN3", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Relu3", 0, 0, {}]]]}, {"name": "MP3", "class_name": "MaxPooling2D", "config": {"name": "MP3", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["BN3", 0, 0, {}]]]}, {"name": "Features", "class_name": "Flatten", "config": {"name": "Features", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["MP3", 0, 0, {}]]]}, {"name": "Drop4", "class_name": "Dropout", "config": {"name": "Drop4", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Features", 0, 0, {}]]]}, {"name": "D4", "class_name": "Dense", "config": {"name": "D4", "trainable": true, "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Drop4", 0, 0, {}]]]}, {"name": "Output", "class_name": "Activation", "config": {"name": "Output", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["D4", 0, 0, {}]]]}], "input_layers": [["Input1", 0, 0]], "output_layers": [["Output", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}